example1/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (4 0 0)
    (4 8 0)
    (0 8 0)
    (0 0 2.4)
    (4 0 2.4)
    (4 8 2.4)
    (0 8 2.4)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 40 12) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    floor
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
    ceiling
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
    eWall
    {
        type wall;
        faces
        (
            (1 2 6 5)
        );
    }
    sWall
    {
        type wall;
        faces
        (
            (0 4 5 1)
        );
    }
    wWall
    {
        type wall;
        faces
        (
            (0 3 7 4)
        );
    }
    nWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
