example1/system/sampleDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}

setFormat       raw;

surfaceFormat   foamFile;

interpolationScheme cellPoint;

fields          ( T U p );

sets
(
    Points
    {
        type    cloud;
        axis    xyz;
        points  (( 1.2 1.6 1.1 )
                );
    }

);

